{
    "name": "Albedo",
    "gender": "Nam",
    "nation": "Mondstadt",
    "description": "Giả Kim Thuật Sĩ đầu tiên của Đội Kỵ Sĩ Tây Phong kiêm đội trưởng tiểu đội điều tra được gọi là Kreideprinz.",
    "vision": "Nham",
    "weapon": "Kiếm Đơn",
    "rarity": 5,
  "body": "Teen",
    "skillTalents": [
      {
        "name": "Tây Phong Kiếm Thuật-Bạch",
        "unlock": "Đánh thường",
        "description": "Đánh thường\nThực hiện tối đa 5 đòn đánh nhanh.\nTrọng kích\nTiêu tốn thể lực  tung nhanh ra 2 nhát kiếm.\nNhảy dậm\nLao từ trên cao xuống, gây sát thương trên đường đi và gây sát thương lan khi chạm đất."
      },
      {
        "name": "Chế Tạo Mặt Trời",
        "unlock": "Kỹ Năng Nguyên Tố",
        "description": "Albedo tạo ra Hoa Mặt Trời gây sát thương phạm vi nguyên tố Nham.\nHoa Mặt Trời\n\nTrong phạm vi ảnh hưởng, Hoa Mặt Trời sẽ tạo ra hiệu ứng Hoa Bay gây ra sát thương phạm vi nguyên tố Nham. Sát thương gây ra phụ thuộc vào chỉ số phòng thủ Albedo. \nHiệu ứng Hoa Bay được tạo sau mỗi 2 giây.\nKhi nhân vật đứng trên Hoa Mặt Trời, đài thủy tinh được tạo ra, nâng nhân vật lên một độ cao nhất định. Cùng lúc chỉ có thể tồn tại một đài thủy tinh, ứng với một Hoa Mặt Trời.\nNhấn giữ để xác định vị trí của kỹ năng."
      },
      {
        "name": "Sóng Vỗ Đại Lục",
        "unlock": "Kỹ Năng Nộ",
        "description": "Các tinh thể Nham tăng lên và bùng phát, gây ra sát thương thương phạm vi nguyên tố Nham về phía trước.\nNếu Hoa Mặt Trời đang tồn tại, 7 cánh Hoa Tử Thần sẽ được tạo ra, bùng phát và gây sát thương phạm vi nguyên tố Nham.\nSát thương bạo và sát thương Hoa TTử Thần sẽ không tạo ra hiệu ứng Hoa Bay."
      }
    ],
    "passiveTalents": [
      {
        "name": "Uy Lực Màu Vôi Trắng",
        "unlock": "Đột phá 1 sao sao",
        "description": "Hiệu ứng Hoa Bay được tạo ra bởi kỹ năng nguyên tố gây thêm 25% sát thương cho mục tiêu có HP dưới 50%."
      },
      {
        "name": "Trí Tuệ Người Trong Bình",
        "unlock": "Đột phá 4 sao",
        "description": "Sử dụng kỹ năng nộ tăng 125 Tinh thông nguyên tố của các thành viên gần đó trong 10 giây."
      },
      {
        "name": "Phát Hiện Của Thiên Tài",
        "unlock": "Mở khóa tự động",
        "description": "Ghép nguyên liệu đột phá vũ khí có 10% tỷ lệ x2 thành phẩm."
      }
    ],
    "constellations": [
      {
        "name": "Hoa Địa Đàng",
        "unlock": "Cung mệnh tầng 1",
        "description": "Khi Hoa Mặt Trời nở sẽ hồi 1,2 năng lượng cho Albedo."
      },
      {
        "name": "Liên Đại Hiển Sinh",
        "unlock": "Cung mệnh tầng 2",
        "description": "Khi Hoa Khoảnh Khắc được sinh ra, Albedo nhận hiệu quả Sinh Tử trong 30s:\n\nMỗi tầng Sinh Tử sẽ tăng sát thương bằng 30% phòng ngự của Albedo.\nTối đa 4 tầng.\n\nKhi thi triển Sóng Vỗ Đại Lục sẽ xóa hiệu ứng và tăng sát thương theo số tầng đã xóa."
      },
      {
        "name": "Ánh Sáng Mặt Trời",
        "unlock": "Cung mệnh tầng 3",
        "description": "Cấp kỹ năng Chế Tạo Mắt Trời +3.\nTăng nhiều nhất 15 cấp."
      },
      {
        "name": "Sự Giáng Thế Của Thần",
        "unlock": "Cung mệnh tầng 4",
        "description": "Tăng 30% sát thương nhảy dậm trong khu vực Hoa Mặt Trời."
      },
      {
        "name": "Thủy Triều Cổ Đại",
        "unlock": "Cung mệnh tầng 5",
        "description": "Cấp kỹ năng Sóng Vỗ Đại Lục +3.\nTăng nhiều nhất 15 cấp."
      },
      {
        "name": "Đất Tinh Khiết",
        "unlock": "Cung mệnh tầng 6",
        "description": "Nhân vật bên trong khu vực Hoa Mặt Trời nếu đang được bảo vệ bởi khiên sinh ra từ phản ứng kết tinh thì sát thương tạo thành sẽ tăng 17%."
      }
    ]
  }